Advanced indexing:

In [40]:
import pandas as pd
cast = pd.read_excel('C:/Users/rammo/OneDrive/Desktop/Cast.xlsx')
cast.head()

,Unnamed: 0,title,year,name,type,character,n
0,0,Closet Monster,2015,Buffy #1,actor,Buffy 4,31.0
1,1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN

In [39]:
titles = pd.read_excel('C:/Users/rammo/OneDrive/Desktop/title.xlsx')
titles.head()

   Unnamed: 0                    title  year
0           0           The Rising Son  1990
1           1  The Thousand Plane Raid  1969
2           2   The Spider and the Fly  1949
3           3                  Country  2000
4           4          The Golden Note  2017

Setting columns as the index

In [41]:
c = cast.set_index('title')

In [42]:
c.head()

,Unnamed: 0,year,name,type,character,n
title,,,,,,
Closet Monster,0,2015,Buffy #1,actor,Buffy 4,31.0
Suuri illusioni,1,1985,Homo $,actor,Guests,22.0
Battle of the Sexes,2,2017,$hutter,actor,Bobby Riggs Fan,10.0
Secret in Their Eyes,3,2015,$hutter,actor,2002 Dodger Fan,NaN
Steve Jobs,4,2015,$hutter,actor,1988 Opera House Patron,NaN

In [43]:
%%time
cast[cast['title'] == 'Steve Jobs']

CPU times: total: 0 ns
Wall time: 2.92 ms

   Unnamed: 0       title  year     name    type                character  n
4           4  Steve Jobs  2015  $hutter  actor   1988 Opera House Patron NaN

In [44]:
%%time
c.loc['Steve Jobs']

CPU times: total: 0 ns
Wall time: 896 Âµs

Unnamed: 0                          4
year                             2015
name                          $hutter
type                           actor
character     1988 Opera House Patron
n                                 NaN
Name: Steve Jobs, dtype: object

In [45]:
c = cast.set_index(['title', 'year'])

In [46]:
c.head()

,,Unnamed: 0,name,type,character,n
title,year,,,,,
Closet Monster,2015,0,Buffy #1,actor,Buffy 4,31.0
Suuri illusioni,1985,1,Homo $,actor,Guests,22.0
Battle of the Sexes,2017,2,$hutter,actor,Bobby Riggs Fan,10.0
Secret in Their Eyes,2015,3,$hutter,actor,2002 Dodger Fan,NaN
Steve Jobs,2015,4,$hutter,actor,1988 Opera House Patron,NaN

In [47]:
%%time
c.loc[('Steve Jobs', 2015),:]

CPU times: total: 0 ns
Wall time: 2.58 ms

<timed eval>:1: PerformanceWarning: indexing past lexsort depth may impact performance.

                 Unnamed: 0     name    type                character  n
title      year
Steve Jobs 2015           4  $hutter  actor   1988 Opera House Patron NaN